In [1]:
import pandas as pd
import numpy as np

In [2]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['chennai','delhi','Mumbai'])

In [3]:
frame

   chennai  delhi  Mumbai
a        0      1       2
c        3      4       5
d        6      7       8

In [4]:
city=['chennai','delhi','kolkata','Mumbai']

In [5]:
frame1=frame.reindex(columns=city)

In [6]:
frame1

   chennai  delhi  kolkata  Mumbai
a        0      1      NaN       2
c        3      4      NaN       5
d        6      7      NaN       8

In [7]:
frame.reindex(index=['a','c','d','e'],method='ffill')

   chennai  delhi  Mumbai
a        0      1       2
c        3      4       5
d        6      7       8
e        6      7       8

In [8]:
frame1.reindex(index=['a','c','d','e'],method='ffill')

   chennai  delhi  kolkata  Mumbai
a        0      1      NaN       2
c        3      4      NaN       5
d        6      7      NaN       8
e        6      7      NaN       8

In [9]:
pd.__version__

'1.0.5'

In [10]:
nframe=frame.drop(['a','d'])

In [11]:
nframe

   chennai  delhi  Mumbai
c        3      4       5

In [12]:
nframe=frame.drop('Mumbai', axis=1)

In [13]:
nframe

   chennai  delhi
a        0      1
c        3      4
d        6      7

In [14]:
ob1=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [15]:
ob1['b']

1.0

In [16]:
ob1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [17]:
ob1[['b','d']]

b    1.0
d    3.0
dtype: float64

In [18]:
ob1[[1,3]]

b    1.0
d    3.0
dtype: float64

In [19]:
ob1[ob1>1]

c    2.0
d    3.0
dtype: float64

In [20]:
ob1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [21]:
ob1['b':'c']=7

In [22]:
ob1

a    0.0
b    7.0
c    7.0
d    3.0
dtype: float64

In [23]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Delhi','Mumbai','Chennai','kolkata'],columns=['one','two','three','four'])

In [24]:
data

         one  two  three  four
Delhi      0    1      2     3
Mumbai     4    5      6     7
Chennai    8    9     10    11
kolkata   12   13     14    15

In [25]:
data['two']

Delhi       1
Mumbai      5
Chennai     9
kolkata    13
Name: two, dtype: int32

In [26]:
data[:1]

       one  two  three  four
Delhi    0    1      2     3

In [27]:
data[data['three']>5]

         one  two  three  four
Mumbai     4    5      6     7
Chennai    8    9     10    11
kolkata   12   13     14    15

In [28]:
data[data['one']<3]

       one  two  three  four
Delhi    0    1      2     3

In [29]:
data.xs('one',axis=1)

Delhi       0
Mumbai      4
Chennai     8
kolkata    12
Name: one, dtype: int32

In [30]:
data.xs('Delhi')

one      0
two      1
three    2
four     3
Name: Delhi, dtype: int32

In [31]:
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Mumbai, dtype: int32

In [32]:
data.at['Mumbai','one']=6

In [33]:
data

         one  two  three  four
Delhi      0    1      2     3
Mumbai     6    5      6     7
Chennai    8    9     10    11
kolkata   12   13     14    15

In [34]:
data['one']

Delhi       0
Mumbai      6
Chennai     8
kolkata    12
Name: one, dtype: int32

# arithmatic with fill values

In [35]:
df1=pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))

In [36]:
df2=pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))

In [37]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [38]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [39]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [40]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [41]:
df_s1=df1.iloc[0]

In [42]:
df_s1

a    0.0
b    1.0
c    2.0
d    3.0
Name: 0, dtype: float64

In [43]:
df1-df_s1

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  4.0  4.0  4.0  4.0
2  8.0  8.0  8.0  8.0

In [44]:
ser2=pd.Series(range(3),index=['b','d','f'])

In [45]:
df1+ser2

    a    b   c     d   f
0 NaN  1.0 NaN   4.0 NaN
1 NaN  5.0 NaN   8.0 NaN
2 NaN  9.0 NaN  12.0 NaN

In [46]:
ser3=df1['b']

In [47]:
ser3

0    1.0
1    5.0
2    9.0
Name: b, dtype: float64

In [48]:
df3=df1.sub(ser3,axis=0)

In [49]:
df3

     a    b    c    d
0 -1.0  0.0  1.0  2.0
1 -1.0  0.0  1.0  2.0
2 -1.0  0.0  1.0  2.0

In [50]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [51]:
ser3

0    1.0
1    5.0
2    9.0
Name: b, dtype: float64

In [52]:
np.abs(df3)

     a    b    c    d
0  1.0  0.0  1.0  2.0
1  1.0  0.0  1.0  2.0
2  1.0  0.0  1.0  2.0

In [53]:
f=lambda a:a.max()-a.min()

In [54]:
df1.apply(f)

a    8.0
b    8.0
c    8.0
d    8.0
dtype: float64

In [55]:
df1.apply(f, axis=1)

0    3.0
1    3.0
2    3.0
dtype: float64

In [56]:
format=lambda a:'%.2f' %a

In [57]:
df1.applymap(format)

      a     b      c      d
0  0.00  1.00   2.00   3.00
1  4.00  5.00   6.00   7.00
2  8.00  9.00  10.00  11.00

In [58]:
df1['a'].map(format)

0    0.00
1    4.00
2    8.00
Name: a, dtype: object

In [59]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [60]:
obj1=pd.Series(range(4),index=['b','d','c','a'])

In [61]:
import pandas as pd

In [62]:
obj1.sort_index()

a    3
b    0
c    2
d    1
dtype: int64

In [63]:
obj1

b    0
d    1
c    2
a    3
dtype: int64

In [64]:
frame1=pd.DataFrame(np.arange(8).reshape(2,4),index=['two','one'],columns=['a','c','b','d'])

# Sorting and Ranking

In [65]:
import numpy as np

In [66]:
frame1

     a  c  b  d
two  0  1  2  3
one  4  5  6  7

In [67]:
frame1.sort_index()

     a  c  b  d
one  4  5  6  7
two  0  1  2  3

In [68]:
frame1.sort_index(axis=1,ascending=False)

     d  c  b  a
two  3  1  2  0
one  7  5  6  4

In [69]:
series1=pd.Series([5,-4,8,1])

In [70]:
series1.sort_values()

1   -4
3    1
0    5
2    8
dtype: int64

In [71]:
obj=pd.Series([4,np.nan,8,np.nan,9,-5])

In [72]:
obj.sort_values()

5   -5.0
0    4.0
2    8.0
4    9.0
1    NaN
3    NaN
dtype: float64

In [73]:
frame6=pd.DataFrame({'d':[7,5,4,9],'b':[3,7,5,9]})

In [74]:
frame6.sort_values(by=['d'])

   d  b
2  4  5
1  5  7
0  7  3
3  9  9

In [75]:
obj11=pd.Series([9,7,6,3,-5,7,3,4,1,3])

In [76]:
obj11.rank()

0    10.0
1     8.5
2     7.0
3     4.0
4     1.0
5     8.5
6     4.0
7     6.0
8     2.0
9     4.0
dtype: float64

In [77]:
obj11.rank(method='max')

0    10.0
1     9.0
2     7.0
3     5.0
4     1.0
5     9.0
6     5.0
7     6.0
8     2.0
9     5.0
dtype: float64

# duplicate values

In [78]:
import pandas as pd

In [79]:
dups=pd.Series(range(5),index=list('aabbc'))

In [80]:
dups

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [81]:
dups.index.is_unique

False

In [82]:
dups['a']

a    0
a    1
dtype: int64

In [83]:
dup_f=pd.DataFrame(np.random.randn(5,3),index=list('aabbc'))

In [84]:
dup_f

          0         1         2
a  0.737849 -1.306243  0.095446
a -0.680793  0.435258  0.858901
b -0.006107  0.273821  2.066399
b -1.205598 -0.600536  0.549248
c -0.032906 -1.258697  1.881786

In [85]:
dup_f.loc['a']

          0         1         2
a  0.737849 -1.306243  0.095446
a -0.680793  0.435258  0.858901

In [86]:
dup_f.xs('a')

          0         1         2
a  0.737849 -1.306243  0.095446
a -0.680793  0.435258  0.858901

# Descriptive statistics

In [87]:
new_df=pd.DataFrame([[1.7,3.4],[np.nan,5.1],[3.4, np.nan],[4.8,7.3]],index=list('abcd'),columns=['one','two'])

In [88]:
new_df

   one  two
a  1.7  3.4
b  NaN  5.1
c  3.4  NaN
d  4.8  7.3

In [89]:
new_df.sum()

one     9.9
two    15.8
dtype: float64

In [90]:
new_df.sum(axis=1)

a     5.1
b     5.1
c     3.4
d    12.1
dtype: float64

In [91]:
new_df.mean()

one    3.300000
two    5.266667
dtype: float64

In [92]:
new_df.mean(axis=1,skipna=False)

a    2.55
b     NaN
c     NaN
d    6.05
dtype: float64

In [93]:
new_df.idxmax()

one    d
two    d
dtype: object

In [94]:
new_df.cumsum()

   one   two
a  1.7   3.4
b  NaN   8.5
c  5.1   NaN
d  9.9  15.8

In [95]:
new_df

   one  two
a  1.7  3.4
b  NaN  5.1
c  3.4  NaN
d  4.8  7.3

In [96]:
new_df.describe()

            one       two
count  3.000000  3.000000
mean   3.300000  5.266667
std    1.552417  1.955335
min    1.700000  3.400000
25%    2.550000  4.250000
50%    3.400000  5.100000
75%    4.100000  6.200000
max    4.800000  7.300000

In [97]:
new_df.quantile()

one    3.4
two    5.1
Name: 0.5, dtype: float64

In [98]:
obj_r=pd.Series(list('accbddbbgh'))

In [99]:
uni=obj_r.unique()

In [100]:
uni

array(['a', 'c', 'b', 'd', 'g', 'h'], dtype=object)

In [101]:
obj_r.value_counts()

b    3
d    2
c    2
a    1
g    1
h    1
dtype: int64

In [102]:
pd.value_counts(obj_r.values,sort=False)

c    2
h    1
g    1
d    2
a    1
b    3
dtype: int64

In [103]:
mask=obj_r.isin(['b','c'])

In [104]:
mask

0    False
1     True
2     True
3     True
4    False
5    False
6     True
7     True
8    False
9    False
dtype: bool

In [105]:
obj_r[mask]

1    c
2    c
3    b
6    b
7    b
dtype: object

In [106]:
new_df.isnull()

     one    two
a  False  False
b   True  False
c  False   True
d  False  False

In [107]:
new_df.dropna()

   one  two
a  1.7  3.4
d  4.8  7.3

In [108]:
new_df.dropna(how='all')

   one  two
a  1.7  3.4
b  NaN  5.1
c  3.4  NaN
d  4.8  7.3

In [109]:
new_df[new_df.notnull()]

   one  two
a  1.7  3.4
b  NaN  5.1
c  3.4  NaN
d  4.8  7.3

In [110]:
df3=pd.DataFrame(np.random.randn(7,3))

In [111]:
df3.loc[:4,1]=np.nan

In [112]:
df3.loc[:2,2]=np.nan

In [113]:
df3

          0         1         2
0 -0.470801       NaN       NaN
1 -0.328046       NaN       NaN
2 -1.174451       NaN       NaN
3 -0.424149       NaN -0.061606
4 -0.055581       NaN  0.925869
5 -1.154110  1.076041 -0.920378
6  0.073531  0.479009  0.654773

In [114]:
df3.fillna(0)

          0         1         2
0 -0.470801  0.000000  0.000000
1 -0.328046  0.000000  0.000000
2 -1.174451  0.000000  0.000000
3 -0.424149  0.000000 -0.061606
4 -0.055581  0.000000  0.925869
5 -1.154110  1.076041 -0.920378
6  0.073531  0.479009  0.654773

In [115]:
df3

          0         1         2
0 -0.470801       NaN       NaN
1 -0.328046       NaN       NaN
2 -1.174451       NaN       NaN
3 -0.424149       NaN -0.061606
4 -0.055581       NaN  0.925869
5 -1.154110  1.076041 -0.920378
6  0.073531  0.479009  0.654773

In [116]:
df3.fillna({1:0.5, 2:-1},inplace=True)

In [117]:
df3

          0         1         2
0 -0.470801  0.500000 -1.000000
1 -0.328046  0.500000 -1.000000
2 -1.174451  0.500000 -1.000000
3 -0.424149  0.500000 -0.061606
4 -0.055581  0.500000  0.925869
5 -1.154110  1.076041 -0.920378
6  0.073531  0.479009  0.654773

# hierarchical indexing

In [118]:
data=pd.Series(np.random.randn(10),index=[list('aaabbbccdd'),[1,2,3,1,2,3,1,2,2,3]])

In [119]:
data

a  1   -1.403236
   2    0.808196
   3   -1.257288
b  1   -1.887314
   2   -0.513786
   3   -0.634053
c  1   -0.219337
   2   -2.104310
d  2   -0.347287
   3   -0.304042
dtype: float64

In [120]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [121]:
data['c']

1   -0.219337
2   -2.104310
dtype: float64

In [122]:
data['b':'c']

b  1   -1.887314
   2   -0.513786
   3   -0.634053
c  1   -0.219337
   2   -2.104310
dtype: float64

In [123]:
data[:,3]

a   -1.257288
b   -0.634053
d   -0.304042
dtype: float64

In [124]:
data[['b','d']]

b  1   -1.887314
   2   -0.513786
   3   -0.634053
d  2   -0.347287
   3   -0.304042
dtype: float64

In [125]:
data1=data.unstack()

In [126]:
data1

          1         2         3
a -1.403236  0.808196 -1.257288
b -1.887314 -0.513786 -0.634053
c -0.219337 -2.104310       NaN
d       NaN -0.347287 -0.304042

In [127]:
data1.stack()

a  1   -1.403236
   2    0.808196
   3   -1.257288
b  1   -1.887314
   2   -0.513786
   3   -0.634053
c  1   -0.219337
   2   -2.104310
d  2   -0.347287
   3   -0.304042
dtype: float64

In [128]:
frame11=pd.DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['c1','c1','c2'],['red','green','red']])

In [129]:
frame11

     c1        c2
    red green red
a 1   0     1   2
  2   3     4   5
b 1   6     7   8
  2   9    10  11

In [130]:
frame11.index.names=['key1','key2']

In [131]:
frame11.columns.names=['col','color']

In [132]:
frame11

col        c1        c2
color     red green red
key1 key2
a    1      0     1   2
     2      3     4   5
b    1      6     7   8
     2      9    10  11

frame11['c1']

In [134]:
frame11['c2']

color      red
key1 key2
a    1       2
     2       5
b    1       8
     2      11

# reordering / sorting levels

In [135]:
frame11.swaplevel('key1','key2')

col        c1        c2
color     red green red
key2 key1
1    a      0     1   2
2    a      3     4   5
1    b      6     7   8
2    b      9    10  11

In [136]:
frame11.sum(level='key1')

col    c1        c2
color red green red
key1
a       3     5   7
b      15    17  19

In [137]:
frame11.sum(level='color', axis=1)

color      red  green
key1 key2
a    1       2      1
     2       8      4
b    1      14      7
     2      20     10

In [138]:
import pandas as pd

In [139]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [140]:
frame1=frame.set_index(['c','d'])

In [141]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [142]:
frame1

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [143]:
frame11=frame.set_index(['c','d'],drop=False)

In [144]:
frame11

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [145]:
frame1.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [146]:
df1=pd.read_csv('Documents/ex1.csv')

In [147]:
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [148]:
df2=pd.read_table('Documents/ex1.csv',sep=',')

In [149]:
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [150]:
df2.to_csv('Documents/out1.csv',sep='|')

In [153]:
 !cat 'Documents/out1.csv'

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [2]:
import pandas as pd

In [ ]:
import sys

In [ ]:
df2.to_csv(sys.stdout,sep='|')

In [7]:
df11=pd.read_csv('Documents/iris.csv')

FileNotFoundError: [Errno 2] File Documents/iris.csv does not exist: 'Documents/iris.csv'

In [154]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [160]:
df11

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [161]:
df11['petal_length']

0      1.4
1      1.4
2      1.3
3      1.5
4      1.4
      ...
145    5.2
146    5.0
147    5.2
148    5.4
149    5.1
Name: petal_length, Length: 150, dtype: float64

In [162]:
df11.loc[146]

sepal_length          6.3
sepal_width           2.5
petal_length            5
petal_width           1.9
species         virginica
Name: 146, dtype: object

In [164]:
df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [165]:
df11.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [166]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [167]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [168]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [169]:
pd.merge(df2,df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [170]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [172]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [175]:
df4=pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [173]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [177]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

df4

In [176]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [178]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [179]:
pd.merge(df1,df2,on='key',how='inner')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [180]:
left=pd.DataFrame({'key1':['foo','foo','ber'],'key2':['one','two','one'],'lval':[1,2,3]})

In [183]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  ber  one     3

In [186]:
rightt=pd.DataFrame({'key1':['foo','foo','ber','bar'],'key2':['one','one','one','two'],'lval':[4,5,6,7]})

In [187]:
rightt

  key1 key2  lval
0  foo  one     4
1  foo  one     5
2  ber  one     6
3  bar  two     7

In [182]:
pd.merge(left,rightt,on=['key1','key2'])

  key1 key2  lval_x  lval_y
0  foo  one       1       4
1  foo  one       1       5
2  ber  one       3       6

In [188]:
pd.merge(left,rightt,on=['key1','key2'],how='outer')

  key1 key2  lval_x  lval_y
0  foo  one     1.0     4.0
1  foo  one     1.0     5.0
2  foo  two     2.0     NaN
3  ber  one     3.0     6.0
4  bar  two     NaN     7.0

In [189]:
pd.merge(left,rightt,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval_left key2_right  lval_right
0  foo       one          1        one           4
1  foo       one          1        one           5
2  foo       two          2        one           4
3  foo       two          2        one           5
4  ber       one          3        one           6

In [190]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})

In [191]:
right1=pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [192]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [193]:
right1

   group_val
a        3.5
b        7.0

In [194]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [196]:
left_h=pd.DataFrame({'key1':['c1','c1','c1','c2','c2'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})

In [ ]:
import numpy as np

In [197]:
right_h=pd.DataFrame((np.arange(12.).reshape(6,2)),index=[['c2','c2','c1','c1','c1','c1'],[2001,2000,2000,2000,2001,2002]],columns=['col1','col2'])

In [198]:
left_h

  key1  key2  data
0   c1  2000   0.0
1   c1  2001   1.0
2   c1  2002   2.0
3   c2  2001   3.0
4   c2  2002   4.0

In [199]:
right_h

         col1  col2
c2 2001   0.0   1.0
   2000   2.0   3.0
c1 2000   4.0   5.0
   2000   6.0   7.0
   2001   8.0   9.0
   2002  10.0  11.0

In [200]:
pd.merge(left_h,right_h,left_on=['key1','key2'],right_index=True)

  key1  key2  data  col1  col2
0   c1  2000   0.0   4.0   5.0
0   c1  2000   0.0   6.0   7.0
1   c1  2001   1.0   8.0   9.0
2   c1  2002   2.0  10.0  11.0
3   c2  2001   3.0   0.0   1.0

In [202]:
left2=pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]], index=['a','c','e'],columns=['c1','c2'])

In [203]:
right2=pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]], index=['b','c','d','e'],columns=['c3','c4'])

In [204]:
left2

    c1   c2
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [205]:
right2

     c3    c4
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [206]:
pd.merge(left2,right2,how='outer',left_index=True, right_index=True)

    c1   c2    c3    c4
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [207]:
left2.join(right2,how='outer')

    c1   c2    c3    c4
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [208]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [210]:
new_df=pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],index=['a','c','e','f'],columns=['c5','c6'])

In [212]:
left2

    c1   c2
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [213]:
right2

     c3    c4
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [214]:
left2.join([right2,new_df])

    c1   c2    c3    c4    c5    c6
a  1.0  2.0   NaN   NaN   7.0   8.0
c  3.0  4.0   9.0  10.0   9.0  10.0
e  5.0  6.0  13.0  14.0  11.0  12.0

In [211]:
new_df

     c5    c6
a   7.0   8.0
c   9.0  10.0
e  11.0  12.0
f  16.0  17.0

In [215]:
left2.join([right2,new_df],how='outer')

    c1   c2    c3    c4    c5    c6
a  1.0  2.0   NaN   NaN   7.0   8.0
c  3.0  4.0   9.0  10.0   9.0  10.0
e  5.0  6.0  13.0  14.0  11.0  12.0
b  NaN  NaN   7.0   8.0   NaN   NaN
d  NaN  NaN  11.0  12.0   NaN   NaN
f  NaN  NaN   NaN   NaN  16.0  17.0

In [219]:
arr=np.arange(12).reshape((3,4))

In [220]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [218]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [278]:
s1=pd.Series([0,1],index=['a','b'])
print(s1)

a    0
b    1
dtype: int64

In [279]:
s2=pd.Series([2,3,4],index=['c','d','e'])
print(s2)

c    2
d    3
e    4
dtype: int64

In [280]:
s3=pd.Series([5,6],index=['f','g'])
print(s3)

f    5
g    6
dtype: int64

In [225]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [226]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [281]:
s4=pd.concat([s1*5,s3])
print(s4)

a    0
b    5
f    5
g    6
dtype: int64

In [228]:
pd.concat([s1,s4],axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [229]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [282]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  5

In [284]:
result=pd.concat([s1,s1,s3],keys=['one','two','three'])

In [285]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [286]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [287]:
pd.concat([s1,s1,s3],axis=1,keys=['one','two','three'])

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [288]:
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])

In [289]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [ ]:
import numpy as np

In [239]:
df2=pd.DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],columns=['three','four'])

In [240]:
df2

   three  four
a      5     6
c      7     8

In [241]:
pd.concat({'level1':df1,'level2':df2},axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [294]:
df5=pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])
print(df5)

upper level1      level2
lower    one  two      a    b
a        0.0  1.0    NaN  NaN
b        2.0  3.0    NaN  NaN
c        4.0  5.0    NaN  NaN
0        NaN  NaN    5.0  NaN
1        NaN  NaN    4.0  3.0
2        NaN  NaN    NaN  4.0
3        NaN  NaN    3.0  6.0
4        NaN  NaN    7.0  8.0

In [295]:
df1=pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
print(df1)

          a         b         c         d
0 -0.236815 -0.388045  0.005157 -1.361492
1  1.166742  0.838223 -0.318531  0.795053
2 -1.410073  0.239418 -0.438284  0.733629

In [244]:
df2=pd.DataFrame(np.random.randn(2,3),columns=['b','d','a'])
print(df2)

          b         d         a
0  0.009438 -0.051824 -0.975074
1 -1.245825  0.623558 -0.983166

In [296]:
df5.unstack()

upper   lower
level1  one    a    0.0
               b    2.0
               c    4.0
               0    NaN
               1    NaN
               2    NaN
               3    NaN
               4    NaN
        two    a    1.0
               b    3.0
               c    5.0
               0    NaN
               1    NaN
               2    NaN
               3    NaN
               4    NaN
level2  a      a    NaN
               b    NaN
               c    NaN
               0    5.0
               1    4.0
               2    NaN
               3    3.0
               4    7.0
        b      a    NaN
               b    NaN
               c    NaN
               0    NaN
               1    3.0
               2    4.0
               3    6.0
               4    8.0
dtype: float64

In [245]:
pd.concat([df1,df2])

          a         b         c         d
0 -0.225532 -1.044405  0.479779  0.495769
1  0.437637  1.830487 -0.538561  0.942619
2 -0.037326 -0.113326 -1.421119 -1.107144
0 -0.975074  0.009438       NaN -0.051824
1 -0.983166 -1.245825       NaN  0.623558

In [246]:
a=pd.Series([np.nan,2.5,np.nan,3.5,4.6,np.nan],index=list('fedcba'))

In [248]:
b=pd.Series(np.arange(len(a),dtype=np.float64) ,index=list('fedcba'))

In [249]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.6
a    NaN
dtype: float64

In [250]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [251]:
b[-1]=np.nan

In [252]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [253]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.6, nan])

In [297]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.6
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [298]:
df1=pd.DataFrame({'a':[1.,np.nan,5.,np.nan],'b':[np.nan,2.,np.nan,6.],'c':range(2,18,4)})
print(df1)

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [299]:
df2=pd.DataFrame({'a':[5.,4.,np.nan,3.,7.],'b':[np.nan,3.,4.,6.,8.]})
print(df2)

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [300]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# reshaping and pivoting

In [258]:
Data=pd.DataFrame(np.arange(6).reshape(2,3),index=pd.Index(['c1','c2'],name='city'),columns=pd.Index(['one','two','three'],name='number'))

In [262]:
Data

number  one  two  three
city
c1        0    1      2
c2        3    4      5

In [260]:
result=Data.stack()

In [261]:
result

city  number
c1    one       0
      two       1
      three     2
c2    one       3
      two       4
      three     5
dtype: int32

In [263]:
result.unstack()

number  one  two  three
city
c1        0    1      2
c2        3    4      5

In [264]:
result.unstack(0)

city    c1  c2
number
one      0   3
two      1   4
three    2   5

In [265]:
result.unstack('city')

city    c1  c2
number
one      0   3
two      1   4
three    2   5

In [266]:
s1=pd.Series([0,1,2,3],index=['a','b','c','d'])

In [268]:
s2=pd.Series([4,5,6],index=['c','d','e'])

In [269]:
data2=pd.concat([s1,s2],keys=['one','two'])

In [270]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [271]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [272]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [273]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [274]:
df=pd.DataFrame({'left':result,'right':result+5},columns=pd.Index(['left','right'],name='side'))

In [275]:
df

side         left  right
city number
c1   one        0      5
     two        1      6
     three      2      7
c2   one        3      8
     two        4      9
     three      5     10

In [276]:
df.unstack('city')

side   left    right
city     c1 c2    c1  c2
number
one       0  3     5   8
two       1  4     6   9
three     2  5     7  10

In [277]:
df.unstack('city').stack('side')

city          c1  c2
number side
one    left    0   3
       right   5   8
two    left    1   4
       right   6   9
three  left    2   5
       right   7  10

# data transformation (removing duplicates)

In [ ]:
data=pd.DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4]})

In [ ]:
data

In [ ]:
data.duplicated()

In [ ]:
data.drop_duplicates()

# Discretization and binning

In [1]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [2]:
bins=[18,25,35,60,100]

In [5]:
catego=pd.cut(ages,bins)

In [4]:
import pandas as pd

In [6]:
catego

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [7]:
pd.value_counts(catego)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [8]:
catego.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
catego.categories

In [ ]:
catego=pd.cut(ages,bins, right=False)

In [ ]:
catego

In [10]:
import numpy as np
data=np.random.rand(20)

In [12]:
data1=pd.cut(data,4,precision=2)
data1

[(0.16, 0.37], (0.57, 0.78], (0.57, 0.78], (0.37, 0.57], (0.78, 0.99], ..., (0.57, 0.78], (0.37, 0.57], (0.37, 0.57], (0.37, 0.57], (0.16, 0.37]]
Length: 20
Categories (4, interval[float64]): [(0.16, 0.37] < (0.37, 0.57] < (0.57, 0.78] < (0.78, 0.99]]

In [13]:
pd.value_counts(data1)

(0.57, 0.78]    6
(0.37, 0.57]    6
(0.16, 0.37]    5
(0.78, 0.99]    3
dtype: int64

In [ ]:
data_n=pd.cut(np.random.randn(10),4)

In [ ]:
data_n

In [ ]:
pd.value_counts(data_n)

In [ ]:
data_n=pd.cut(np.random.randn(1000),4)

In [ ]:
pd.value_counts(data_n)

In [ ]:
cat1=pd.qcut(data,4)

In [ ]:
cat1

In [ ]:
pd.value_counts(cat1)

In [15]:
data11=np.arange(20)

In [16]:
cat1_c=pd.cut(data11,4)

In [17]:
pd.value_counts(cat1_c)

(14.25, 19.0]     5
(9.5, 14.25]      5
(4.75, 9.5]       5
(-0.019, 4.75]    5
dtype: int64

In [18]:
cat1_qc=pd.qcut(data11,4)

In [19]:
pd.value_counts(cat1_qc)

(14.25, 19.0]     5
(9.5, 14.25]      5
(4.75, 9.5]       5
(-0.001, 4.75]    5
dtype: int64

In [20]:
cat1_qc1=pd.qcut(data11,[0,0.3,0.5,0.7,1])

In [27]:
pd.value_counts(cat1_qc1)

(13.3, 19.0]     6
(-0.001, 5.7]    6
(9.5, 13.3]      4
(5.7, 9.5]       4
dtype: int64

In [28]:
cat1_c1=pd.cut(data11,[0,0.3,0.5,0.7,1])

In [25]:
pd.value_counts(cat1_c1)

(0.7, 1.0]    1
(0.5, 0.7]    0
(0.3, 0.5]    0
(0.0, 0.3]    0
dtype: int64

In [22]:
cat1_c1=pd.cut(data11,[0,3,5,7,10,20])

In [23]:
pd.value_counts(cat1_c1)

(10, 20]    9
(7, 10]     3
(0, 3]      3
(5, 7]      2
(3, 5]      2
dtype: int64